# SQLITE

### Know about SQLlite

"""
Data Base is the logical collections of tables. Whereas tables are collection of rows and column.
coloums are known as attributed,characterstics and Rows are also known as Tuples.

DMBS= Full form Data Base Management system, 
USERs by using SQL (Structured Query Lanaguage) one can interact with DBMS.

SQL is of 3 type.

1. DDL(Data Defination Language)-->Creat,Alter,Drop
2. DML(Data Manipulation Language)--->Select, Update, Delete
3. DCL(Data Control Language)---->Grant-REvoke,commit-Rollback


we can import by calling----> import sqllite3

we can create or creat connection with DB with -----> db=sqlite3.connect

we need to create cursor area or pointer area form where we are working.----->cur=db.cursor()

"""

In [1]:
# calling sql library(sql is a realtional data )

import sqlite3

In [2]:
# connecting and creating a DB named("Stuent_database")

mydb=sqlite3.connect("Student_database.db")

In [3]:
# cursor is created (cusrsor is an object, its works as a pointer)

cur=mydb.cursor()

In [4]:
# creating table ("create table <table name> (id int primary key, name text, marks int)")

cur.execute("Create table NewStudent (id int primary key, name text,marks int)")

### INSERT DATA in student table

In [5]:
cur.execute("insert into Newstudent(id,name,marks) values(1,'John',90)")

In [6]:
print(cur.rowcount,"REcords inserted")

1 REcords inserted

In [7]:
# db.commit()will save ur work done

In [8]:
mydb.commit()

In [9]:
cur.execute("insert into Newstudent(id,name,marks) values(2,'Andrew',78)")
mydb.commit() #inserted data and saved

In [10]:
results=cur.execute("Select * from Newstudent")

print(results) # will not print need to use loop

<sqlite3.Cursor object at 0x000001948B87E730>

In [11]:
for i in results:
    print(i)

(1, 'John', 90)
(2, 'Andrew', 78)

In [12]:
cur.execute("Select * from Newstudent")

# wont show directly, need to add variable to show details and call by loop.

In [14]:
cur.execute("insert into Newstudent(id,name,marks) values(3,'Andy',80)")

In [15]:
print(cur.rowcount)

1

In [16]:
mydb.commit()

In [17]:
cur.execute("insert into Newstudent values(4,'jack',78)")
mydb.commit()

In [19]:
#DATA BASE WILL BE CREATED IN THE GIVEN LOCATION

In [18]:
"""
db1=sqlite3.connect("E:/MySQlite_DataBase/studentdb.db")

# this will created dataBase to perticular location

"""

'\ndb1=sqlite3.connect("E:/MySQlite_DataBase/studentdb.db")\n\n# this will created dataBase to perticular location\n\n'

In [20]:
cur.execute("insert into Newstudent values(5,'Jill',88)")
mydb.commit()

In [22]:
result=cur.execute("Select * from Newstudent")

for i in result:
    print(i)

(1, 'John', 90)
(2, 'Andrew', 78)
(3, 'Andy', 80)
(4, 'jack', 78)
(5, 'Jill', 88)

### SELECT ONLY column from table

In [25]:
cur.execute("Select Name,id from Newstudent")

In [26]:
result=cur.execute("Select Name,id from Newstudent")

for i in result:
    print(i)

('John', 1)
('Andrew', 2)
('Andy', 3)
('jack', 4)
('Jill', 5)

In [27]:
result=cur.execute("Select Name, Id, marks from Newstudent" )

In [28]:
for i in result:
    print(i)

('John', 1, 90)
('Andrew', 2, 78)
('Andy', 3, 80)
('jack', 4, 78)
('Jill', 5, 88)

In [32]:
result=cur.execute("Select * from NewStudent")

In [33]:
for i in result:
    print (i)

(1, 'John', 90)
(2, 'Andrew', 78)
(3, 'Andy', 80)
(4, 'jack', 78)
(5, 'Jill', 88)

In [34]:
result=cur.execute("select name,marks from Newstudent")

for i in result:
    print(i)

('John', 90)
('Andrew', 78)
('Andy', 80)
('jack', 78)
('Jill', 88)

In [36]:
result=cur.execute("select * from Newstudent where id=1 ")

for i in result:
    print(i)

(1, 'John', 90)

In [38]:
result=cur.execute("select * from Newstudent where id=2 ")

for i in result:
    print(i)

(2, 'Andrew', 78)

In [41]:
result=cur.execute("Select * from NewStudent where id=4")

In [42]:
for i in result:
    print(i)

(4, 'jack', 78)

#### LIMIT KEYWORD

In [43]:
result=cur.execute("Select * from NewStudent limit 3") #will show on 3 from top

In [44]:
for i in result:
    print(i)

(1, 'John', 90)
(2, 'Andrew', 78)
(3, 'Andy', 80)

In [45]:
result=cur.execute("select * from NewStudent limit 5")

for i in result:
    print(i)

(1, 'John', 90)
(2, 'Andrew', 78)
(3, 'Andy', 80)
(4, 'jack', 78)
(5, 'Jill', 88)

In [50]:
result= cur.execute("Select * from Newstudent limit 0,5")

for i in result:
    print(i)

(1, 'John', 90)
(2, 'Andrew', 78)
(3, 'Andy', 80)
(4, 'jack', 78)
(5, 'Jill', 88)

In [52]:
print(cur.rowcount)

-1

In [53]:
result= cur.execute("Select * from Newstudent where marks>60")

In [54]:
for i in result:
    print(i)

(1, 'John', 90)
(2, 'Andrew', 78)
(3, 'Andy', 80)
(4, 'jack', 78)
(5, 'Jill', 88)

In [58]:
result=cur.execute("select marks from newstudent where name= 'John' ")

for i in result:
    print(i)

(90,)

### Logical Operator(And, Or, Not Null)

"""
AND operator will check both the statements and would find both boolean from the given data and will give us the filtered data.

OR operator will check both booleans, if any one is correct.

NOT-NULL: Will check if the given table and display No-empty data.

NULL: WILL check for NUll values.

"""

In [60]:
result=cur.execute("select * from Newstudent where marks>70 and marks<80")

for i in result:
    print(i)

(2, 'Andrew', 78)
(4, 'jack', 78)

In [68]:
result=cur.execute("Select * from Newstudent where id<3 and marks<100")

for i in result:
    print(i)

(1, 'John', 90)
(2, 'Andrew', 78)

In [73]:
result=cur.execute("Select name,marks from Newstudent where name='Jhon' or marks>80 ")

for i in result:
    print(i)

('John', 90)
('Jill', 88)

In [75]:
result=cur.execute("Select * from Newstudent")
result.fetchall()

[(1, 'John', 90),
 (2, 'Andrew', 78),
 (3, 'Andy', 80),
 (4, 'jack', 78),
 (5, 'Jill', 88)]

In [77]:
# ORDER BY CLAUSE (select * from student order by name asc)


result=cur.execute("Select * from Newstudent order by marks desc")

result.fetchall()

[(1, 'John', 90),
 (5, 'Jill', 88),
 (3, 'Andy', 80),
 (2, 'Andrew', 78),
 (4, 'jack', 78)]

In [79]:
result=cur.execute("Select * from Newstudent order by marks asc")

result.fetchall()

[(2, 'Andrew', 78),
 (4, 'jack', 78),
 (3, 'Andy', 80),
 (5, 'Jill', 88),
 (1, 'John', 90)]

In [80]:
result=cur.execute("Select * from Newstudent where name='Jill' and Marks='88'")

result.fetchall()

[(5, 'Jill', 88)]

In [81]:
result=cur.execute("select * from Newstudent where Name='A%' or marks>80")

In [82]:
for i in result:
    print(i)

(1, 'John', 90)
(5, 'Jill', 88)

In [1]:
result=cur.execute("select * from Newstudent where Name like 'A%')

SyntaxError: EOL while scanning string literal (3157119385.py, line 1)

###  Aggregate functions:(count,min,max,Avg,sum)

In [87]:
result=cur.execute("select min(marks) from Newstudent")
result.fetchall()

[(78,)]

single row can be called result.fetchone(), 

result.fetchall() for calling more than one

In [88]:
result=cur.execute("Select max(marks) from Newstudent")

result.fetchall()

[(90,)]

In [89]:
result=cur.execute("select avg(marks) from Newstudent")
result.fetchone()

(82.8,)

In [90]:
result=cur.execute("Select count(marks) from Newstudent")
result.fetchone()

(5,)

In [91]:
result=cur.execute("select count(name), Avg(marks), min(marks),max(marks) from Newstudent")
result.fetchall()

[(5, 82.8, 78, 90)]

In [96]:
result=cur.execute("select * from Newstudent where marks is null")
result.fetchall()

[]

In [97]:
result=cur.execute("select * from Newstudent where marks is not null")
result.fetchall()

[(1, 'John', 90),
 (2, 'Andrew', 78),
 (3, 'Andy', 80),
 (4, 'jack', 78),
 (5, 'Jill', 88)]

In [99]:
cur.execute("insert into Newstudent values(6,'ABC',79),(9,'DBC',78),(10,'FEB',67)")

In [100]:
cur.rowcount

3

In [102]:
result=cur.execute("Select * from Newstudent where name like'J%' ")

for i in result:
    print(i)

(1, 'John', 90)
(4, 'jack', 78)
(5, 'Jill', 88)

In [118]:
result=cur.execute("Select * from NewStudent")

In [104]:
result.fetchall()

[(1, 'John', 90),
 (2, 'Andrew', 78),
 (3, 'Andy', 80),
 (4, 'jack', 78),
 (5, 'Jill', 88),
 (6, 'ABC', 79),
 (9, 'DBC', 78),
 (10, 'FEB', 67)]

In [105]:
sql="Insert into Newstudent values(8,'McDonald',69),(7,'Michel',59),(12,'Austin',89),(11,'adele',88)"

In [106]:
cur.execute(sql)

In [107]:
mydb.commit()

In [111]:
cur.rowcount

4

In [116]:
result.fetchall()

[(1, 'John', 90),
 (2, 'Andrew', 78),
 (3, 'Andy', 80),
 (4, 'jack', 78),
 (5, 'Jill', 88),
 (6, 'ABC', 79),
 (7, 'Michel', 59),
 (8, 'McDonald', 69),
 (9, 'DBC', 78),
 (10, 'FEB', 67),
 (11, 'adele', 88),
 (12, 'Austin', 89)]

In [121]:
sql="select * from Newstudent order by id asc"

cur.execute(sql)

In [122]:
mydb.commit()

In [123]:
result.fetchall()

[(1, 'John', 90),
 (2, 'Andrew', 78),
 (3, 'Andy', 80),
 (4, 'jack', 78),
 (5, 'Jill', 88),
 (6, 'ABC', 79),
 (7, 'Michel', 59),
 (8, 'McDonald', 69),
 (9, 'DBC', 78),
 (10, 'FEB', 67),
 (11, 'adele', 88),
 (12, 'Austin', 89)]

In [133]:
# checking all char starting with A

result=cur.execute("select * from Newstudent where name like 'A%' " )

In [134]:
for i in result:
    print(i)

(2, 'Andrew', 78)
(3, 'Andy', 80)
(6, 'ABC', 79)
(12, 'Austin', 89)
(11, 'adele', 88)

In [135]:
# Checking all char ending with l

result=cur.execute("select * from Newstudent where name like '%l' " )

result.fetchall()

[(5, 'Jill', 88), (7, 'Michel', 59)]

In [146]:
# checking all char mid word _a 

result=cur.execute("Select * from Newstudent where name like '_e%' ")

for i in result:
    print (i)

(10, 'FEB', 67)

In [147]:
# checking all char mid word to be e
result=cur.execute("Select * from Newstudent where name like '__e%'")
result.fetchone()

(11, 'adele', 88)

In [148]:
# checking all char 4 word.
result=cur.execute("Select * from Newstudent where name like '____'")
result.fetchone()# 4char value

(1, 'John', 90)

### NOT IN,  NOT, UPDATE OPERATOR

In [151]:
result=cur.execute("Select * from NewStudent where name is NOt 'John'")

result.fetchall()

[(2, 'Andrew', 78),
 (3, 'Andy', 80),
 (4, 'jack', 78),
 (5, 'Jill', 88),
 (6, 'ABC', 79),
 (9, 'DBC', 78),
 (10, 'FEB', 67),
 (8, 'McDonald', 69),
 (7, 'Michel', 59),
 (12, 'Austin', 89),
 (11, 'adele', 88)]

In [152]:
result=cur.execute("select * from Newstudent where name is 'John'")

result.fetchall()

[(1, 'John', 90)]

In [153]:
# upadte(DMl)
sql="update Newstudent set marks=81 where id=4"
cur.execute(sql)

In [155]:
mydb.commit()

In [158]:
result=cur.execute("Select * from Newstudent")
result.fetchall()

[(1, 'John', 90),
 (2, 'Andrew', 78),
 (3, 'Andy', 80),
 (4, 'jack', 81),
 (5, 'Jill', 88),
 (6, 'ABC', 79),
 (9, 'DBC', 78),
 (10, 'FEB', 67),
 (8, 'McDonald', 69),
 (7, 'Michel', 59),
 (12, 'Austin', 89),
 (11, 'adele', 88)]

In [160]:
# multiple record update:

sql="update Newstudent set marks=90 where id in (1,3,5)"

cur.execute(sql)

In [161]:
mydb.commit()

In [164]:
result=cur.execute("select * from newStudent")

result.fetchall()

[(1, 'John', 90),
 (2, 'Andrew', 78),
 (3, 'Andy', 90),
 (4, 'jack', 81),
 (5, 'Jill', 90),
 (6, 'ABC', 79),
 (9, 'DBC', 78),
 (10, 'FEB', 67),
 (8, 'McDonald', 69),
 (7, 'Michel', 59),
 (12, 'Austin', 89),
 (11, 'adele', 88)]

# Delete record:

In [166]:
cur.execute("delete from Newstudent where marks=59")

In [168]:
mydb.commit()

In [169]:
re=cur.execute("select * from Newstudent")

re.fetchall()

[(1, 'John', 90),
 (2, 'Andrew', 78),
 (3, 'Andy', 90),
 (4, 'jack', 81),
 (5, 'Jill', 90),
 (6, 'ABC', 79),
 (9, 'DBC', 78),
 (10, 'FEB', 67),
 (8, 'McDonald', 69),
 (12, 'Austin', 89),
 (11, 'adele', 88)]

In [1]:
# del is to delete the row
# drop of table
# db.close will close the database
# drop database will drop database.

---------------------------------------

In [3]:
import sqlite3

## ADDING DATA IN TABLE WITH CSV(Coma Seperated values)file directly

In [6]:
mdb=sqlite3.connect("G:/Data_Base/scores_datbase.db") # db gets created on the location

In [7]:
cur=mdb.cursor()

In [10]:
cur.execute("Create table Score(name TEXT ,id INT primarykey ,gender char(6) ,Score int)")

In [11]:
mdb.commit()

In [16]:
sql="insert into score values('Rohit',101 ,'Male',55)"
cur.execute(sql)
mdb.commit()

In [19]:
sql="insert into score values('Ram',102,'Male',56),('Rihana',103,'Female',30),('Ritu',104,'Female',60)"

In [20]:
cur.execute(sql)
mdb.commit()

In [22]:
cur.rowcount

3

In [44]:
result=cur.execute("Select * from score")

In [45]:
result.fetchall()

[('Ram', 102, 'Male', 79),
 ('Rihana', 103, 'Female', 30),
 ('Ritu', 104, 'Female', 60),
 ('Ram', 100, 'Male', 79)]

In [32]:
sql="delete from score where score=55 "

In [33]:
cur.execute(sql)

mdb.commit()

In [36]:
sql="insert into score values('Ram',100,'Male',59)"

In [37]:
cur.execute(sql)

In [38]:
db.commit()

In [41]:
sql="update score set score=79 where name is 'Ram' "

In [43]:
cur.execute(sql)
db.commit()

In [49]:
db.close()